In [174]:
import pandas as pd
import numpy as np

In [175]:
df=pd.read_csv('data.csv',delimiter=",")
df.shape

(10, 4)

In [176]:
data=df.copy()

In [177]:
data.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [178]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [179]:
# data.dropna(inplace=True)

In [180]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [181]:
# data.fillna(data.mean())

In [182]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

**using imputer to fill na values**

In [183]:
from sklearn.impute import SimpleImputer as si
imputer=si(fill_value=np.nan,strategy='mean')
x=imputer.fit_transform(data[['Age','Salary']])
x=pd.DataFrame(x)
x

           0             1
0  44.000000  72000.000000
1  27.000000  48000.000000
2  30.000000  54000.000000
3  38.000000  61000.000000
4  40.000000  63777.777778
5  35.000000  58000.000000
6  38.777778  52000.000000
7  48.000000  79000.000000
8  50.000000  83000.000000
9  37.000000  67000.000000

In [184]:
data[['Age','Salary']]=x[[0,1]]

In [185]:
data['Country'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

**To Change String Data into numerical**

In [186]:
#M-1
# def f(d):
#     if(d=='France'):
#         return 0
#     elif(d=='Spain'):
#         return 1
#     elif(d=='Germany'):
#         return 2
# data['Place']=data.Country.apply(f)

In [187]:
data.Country.dtype

dtype('O')

In [188]:
#M-2:
from sklearn import preprocessing as ps
le=ps.LabelEncoder()
data.Country=le.fit_transform(data.Country)

In [189]:
data.Country.dtype

dtype('int32')

In [190]:
data[data.Country==2]

   Country        Age   Salary Purchased
1        2  27.000000  48000.0       Yes
3        2  38.000000  61000.0        No
6        2  38.777778  52000.0        No

In [193]:
#One hot encoder
df2 = pd.get_dummies(data=data)
print(df2)

   Country        Age        Salary  Purchased_No  Purchased_Yes
0        0  44.000000  72000.000000             1              0
1        2  27.000000  48000.000000             0              1
2        1  30.000000  54000.000000             1              0
3        2  38.000000  61000.000000             1              0
4        1  40.000000  63777.777778             0              1
5        0  35.000000  58000.000000             0              1
6        2  38.777778  52000.000000             1              0
7        0  48.000000  79000.000000             0              1
8        1  50.000000  83000.000000             1              0
9        0  37.000000  67000.000000             0              1